#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```terraform

Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/posfiap/pos-fiap/runs/run-47qY3Cith5Jw1qs3

Waiting for the plan to start...

Terraform v1.6.3
on linux_amd64
Initializing plugins and modules...
aws_ecr_repository.repo: Refreshing state... [id=app_repo]
aws_iam_role.ecs_execution_role: Refreshing state... [id=ecsExecutionRole]
aws_vpc.vpc: Refreshing state... [id=vpc-07e73cff97f426c9a]
aws_ecs_cluster.ecs: Refreshing state... [id=arn:aws:ecs:us-east-1:027260563052:cluster/app_cluster]
aws_cloudwatch_log_group.techchallenge-logs: Refreshing state... [id=awslogs-techchallenge]
aws_iam_policy_attachment.ecs_execution_role_attachment: Refreshing state... [id=ecsExecutionRoleAttachment]
aws_subnet.sn1: Refreshing state... [id=subnet-050f0395dafd207de]
aws_subnet.sn2: Refreshing state... [id=subnet-073857a06395b3be9]
aws_internet_gateway.gw: Refreshing state... [id=igw-08018bf3c1dd4035e]
aws_subnet.sn3: Refreshing state... [id=subnet-04d747b60cad2763e]
aws_security_group.sg: Refreshing state... [id=sg-010569a0a64ec7592]
aws_route_table.rt: Refreshing state... [id=rtb-00f4c6c4fe5651841]
aws_ecs_service.service: Refreshing state... [id=arn:aws:ecs:us-east-1:027260563052:service/app_cluster/app_service]
aws_route_table_association.route3: Refreshing state... [id=rtbassoc-06e648823e1779c37]
aws_route_table_association.route2: Refreshing state... [id=rtbassoc-09d7a8f263a652e49]
aws_route_table_association.route1: Refreshing state... [id=rtbassoc-072ea815c57e5d52a]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_ecs_service.service will be updated in-place
  ~ resource "aws_ecs_service" "service" {
        id                                 = "arn:aws:ecs:us-east-1:027260563052:service/app_cluster/app_service"
        name                               = "app_service"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:us-east-1:027260563052:task-definition/app:13" -> (known after apply)
        # (15 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.td will be created
  + resource "aws_ecs_task_definition" "td" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = jsonencode(
            [
              + {
                  + cpu          = 512
                  + essential    = true
                  + image        = "027260563052.dkr.ecr.us-east-1.amazonaws.com/app_repo"
                  + memory       = 1024
                  + name         = "app"
                  + portMappings = [
                      + {
                          + containerPort = 8080
                          + hostPort      = 8080
                        },
                    ]
                },
            ]
        )
      + cpu                      = "512"
      + execution_role_arn       = "arn:aws:iam::027260563052:role/ecsExecutionRole"
      + family                   = "app"
      + id                       = (known after apply)
      + memory                   = "1024"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags_all                 = (known after apply)
      + task_role_arn            = "arn:aws:iam::027260563052:role/ecsExecutionRole"
    }

Plan: 1 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>
*Pushed by: @lucassoaresaraujo, Action: `pull_request`*